src/main/resources/soap/FindGroupsLite.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://soap_v2_0.ws.grouper.middleware.internet2.edu/xsd">
  <soapenv:Header/>
  <soapenv:Body>
    <xsd:findGroupsLite>
      <xsd:clientVersion>2.0.0</xsd:clientVersion>
      <xsd:queryFilterType>FIND_BY_GROUP_NAME_EXACT</xsd:queryFilterType>
      <!-- We use the unique name of Grouper as the identifier within SURFconext -->
      <xsd:groupName>[groupId]</xsd:groupName>
      <xsd:actAsSubjectId>[subjectId]</xsd:actAsSubjectId>
    </xsd:findGroupsLite>
  </soapenv:Body>
</soapenv:Envelope>
